#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
tls_private_key.example: Refreshing state... [id=6885d8c4df232567c714f31fdeb870a76ebbeac8]
random_password.dbpassword: Refreshing state... [id=none]
aws_vpc.epsi-tf: Refreshing state... [id=vpc-00cdacb8f6d21122e]
aws_key_pair.deployer: Refreshing state... [id=ec2-key-tf]
aws_subnet.private-a: Refreshing state... [id=subnet-0f2522d7a5c3dcee1]
aws_internet_gateway.igw-tf: Refreshing state... [id=igw-0b072b362671bca4f]
aws_subnet.private-b: Refreshing state... [id=subnet-01ecc5a04bcd677ac]
aws_subnet.public-a: Refreshing state... [id=subnet-05527e28a8ec9f23e]
aws_subnet.public-b: Refreshing state... [id=subnet-0f602b2119cf23008]
aws_security_group.allow_http: Refreshing state... [id=sg-0e3ade62f21e33d49]
aws_route_table.public: Refreshing state... [id=rtb-0cb68908c17e04ffd]
aws_security_group.allow_rds: Refreshing state... [id=sg-029b22d9e1af68083]
aws_route_table_association.a: Refreshing state... [id=rtbassoc-05872036d8b15cee7]
aws_route_table_association.b: Refreshing state... [id=rtbassoc-049c8019c089725fb]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_db_instance.dbWordPress will be created
  + resource "aws_db_instance" "dbWordPress" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "wordpress"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "5.7"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = "wordpress"
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + status                                = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Name" = "WordPress DB"
        }
      + timezone                              = (known after apply)
      + username                              = "admin"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_subnet_group.rds will be created
  + resource "aws_db_subnet_group" "rds" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "wordpress"
      + name_prefix = (known after apply)
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Name" = "wordpress-rds"
        }
    }

  # aws_instance.wordpress will be created
  + resource "aws_instance" "wordpress" {
      + ami                          = "ami-02fe94dee086c0c37"
      + arn                          = (known after apply)
      + associate_public_ip_address  = true
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = "ec2-key-tf"
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tags                         = {
          + "Name"   = "wordpress"
          + "school" = "epsi"
          + "type"   = "webserver"
        }
      + tenancy                      = (known after apply)
      + user_data                    = "bb901e5b8769933432c3e14887540583119453dc"
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_internet_gateway.igw-tf will be created
  + resource "aws_internet_gateway" "igw-tf" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "igw-tf"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                = "0.0.0.0/0"
              + egress_only_gateway_id    = ""
              + gateway_id                = (known after apply)
              + instance_id               = ""
              + ipv6_cidr_block           = ""
              + local_gateway_id          = ""
              + nat_gateway_id            = ""
              + network_interface_id      = ""
              + transit_gateway_id        = ""
              + vpc_endpoint_id           = ""
              + vpc_peering_connection_id = ""
            },
        ]
      + tags             = {
          + "Name" = "public-tf"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.a must be replaced
-/+ resource "aws_route_table_association" "a" {
      ~ id             = "rtbassoc-05872036d8b15cee7" -> (known after apply)
      ~ route_table_id = "rtb-0cb68908c17e04ffd" -> (known after apply)
      ~ subnet_id      = "subnet-05527e28a8ec9f23e" -> (known after apply) # forces replacement
    }

  # aws_route_table_association.b must be replaced
-/+ resource "aws_route_table_association" "b" {
      ~ id             = "rtbassoc-049c8019c089725fb" -> (known after apply)
      ~ route_table_id = "rtb-0cb68908c17e04ffd" -> (known after apply)
      ~ subnet_id      = "subnet-0f602b2119cf23008" -> (known after apply) # forces replacement
    }

  # aws_security_group.allow_http will be created
  + resource "aws_security_group" "allow_http" {
      + arn                    = (known after apply)
      + description            = "Allow http inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP from VPC"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "allow_http"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "allow_http"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.allow_rds will be created
  + resource "aws_security_group" "allow_rds" {
      + arn                    = (known after apply)
      + description            = "Allow mysql inbound traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "allow_rds"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "allow_http-tf"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private-a will be created
  + resource "aws_subnet" "private-a" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "private-a-tf"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.private-b will be created
  + resource "aws_subnet" "private-b" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.4.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "private-b-tf"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.public-a will be created
  + resource "aws_subnet" "public-a" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "public-a-tf"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.public-b will be created
  + resource "aws_subnet" "public-b" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "public-b-tf"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_vpc.epsi-tf will be created
  + resource "aws_vpc" "epsi-tf" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "epsi-tf"
        }
    }

Plan: 14 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + public_ip = (known after apply)

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```
</details>
#### Terraform Apply 🖌`success`
<details><summary>Show Apply</summary>
```terraform
[0m[1mtls_private_key.example: Refreshing state... [id=6885d8c4df232567c714f31fdeb870a76ebbeac8][0m
[0m[1mrandom_password.dbpassword: Refreshing state... [id=none][0m
[0m[1maws_key_pair.deployer: Refreshing state... [id=ec2-key-tf][0m
[0m[1maws_vpc.epsi-tf: Refreshing state... [id=vpc-00cdacb8f6d21122e][0m
[0m[1maws_internet_gateway.igw-tf: Refreshing state... [id=igw-0b072b362671bca4f][0m
[0m[1maws_subnet.public-a: Refreshing state... [id=subnet-05527e28a8ec9f23e][0m
[0m[1maws_subnet.private-a: Refreshing state... [id=subnet-0f2522d7a5c3dcee1][0m
[0m[1maws_security_group.allow_http: Refreshing state... [id=sg-0e3ade62f21e33d49][0m
[0m[1maws_subnet.private-b: Refreshing state... [id=subnet-01ecc5a04bcd677ac][0m
[0m[1maws_subnet.public-b: Refreshing state... [id=subnet-0f602b2119cf23008][0m
[0m[1maws_route_table.public: Refreshing state... [id=rtb-0cb68908c17e04ffd][0m
[0m[1maws_security_group.allow_rds: Refreshing state... [id=sg-029b22d9e1af68083][0m
[0m[1maws_route_table_association.b: Refreshing state... [id=rtbassoc-049c8019c089725fb][0m
[0m[1maws_route_table_association.a: Refreshing state... [id=rtbassoc-05872036d8b15cee7][0m
[0m[1maws_route_table_association.a: Destroying... [id=rtbassoc-05872036d8b15cee7][0m[0m
[0m[1maws_route_table_association.b: Destroying... [id=rtbassoc-049c8019c089725fb][0m[0m
[0m[1maws_vpc.epsi-tf: Creating...[0m[0m
[0m[1maws_route_table_association.a: Destruction complete after 0s[0m[0m
[0m[1maws_route_table_association.b: Destruction complete after 0s[0m[0m
[0m[1maws_vpc.epsi-tf: Creation complete after 1s [id=vpc-0628e158123f1747a][0m[0m
[0m[1maws_subnet.public-b: Creating...[0m[0m
[0m[1maws_security_group.allow_http: Creating...[0m[0m
[0m[1maws_subnet.public-a: Creating...[0m[0m
[0m[1maws_subnet.private-b: Creating...[0m[0m
[0m[1maws_subnet.private-a: Creating...[0m[0m
[0m[1maws_internet_gateway.igw-tf: Creating...[0m[0m
[0m[1maws_internet_gateway.igw-tf: Creation complete after 1s [id=igw-06e45346357a8d3db][0m[0m
[0m[1maws_route_table.public: Creating...[0m[0m
[0m[1maws_subnet.private-b: Creation complete after 1s [id=subnet-0459a717378437eb9][0m[0m
[0m[1maws_subnet.public-a: Creation complete after 1s [id=subnet-02271d48835ee7daa][0m[0m
[0m[1maws_subnet.public-b: Creation complete after 1s [id=subnet-0feb73a0520a1d85e][0m[0m
[0m[1maws_subnet.private-a: Creation complete after 1s [id=subnet-0a72e116df855dfcf][0m[0m
[0m[1maws_db_subnet_group.rds: Creating...[0m[0m
[0m[1maws_security_group.allow_http: Creation complete after 1s [id=sg-0694122bfe1004989][0m[0m
[0m[1maws_security_group.allow_rds: Creating...[0m[0m
[0m[1maws_route_table.public: Creation complete after 0s [id=rtb-0e061e6ae85a84acc][0m[0m
[0m[1maws_route_table_association.b: Creating...[0m[0m
[0m[1maws_route_table_association.a: Creating...[0m[0m
[0m[1maws_route_table_association.a: Creation complete after 0s [id=rtbassoc-072770ef0509d9c7f][0m[0m
[0m[1maws_route_table_association.b: Creation complete after 0s [id=rtbassoc-05e1afac58f1e0d36][0m[0m
[0m[1maws_db_subnet_group.rds: Creation complete after 1s [id=wordpress][0m[0m
[0m[1maws_security_group.allow_rds: Creation complete after 1s [id=sg-0e5d450a049d2c5c9][0m[0m
[0m[1maws_db_instance.dbWordPress: Creating...[0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [10s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [20s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [30s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [40s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [50s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [1m0s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [1m10s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [1m20s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [1m30s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [1m40s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [1m50s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [2m0s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [2m10s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [2m20s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [2m30s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [2m40s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [2m50s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [3m0s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [3m10s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [3m20s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [3m30s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still creating... [3m40s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Creation complete after 3m45s [id=terraform-20210226110443265600000001][0m[0m
[0m[1maws_instance.wordpress: Creating...[0m[0m
[0m[1maws_instance.wordpress: Still creating... [10s elapsed][0m[0m
[0m[1maws_instance.wordpress: Still creating... [20s elapsed][0m[0m
[0m[1maws_instance.wordpress: Creation complete after 21s [id=i-081b221bb04e856f7][0m[0m
[0m[1m[32m
Apply complete! Resources: 14 added, 0 changed, 2 destroyed.[0m
[0m[1m[32m
Outputs:

db_password = "D23YxH8MKj7mbQOs"
private_key = <<EOT
-----BEGIN RSA PRIVATE KEY-----
MIIJKAIBAAKCAgEA6XMPOQjs/jfVzY1QiS2bymHb45eFs6RElmsCngLizmp4FMfr
ctuB95gnuOOg5Ih0Y2QRHxYufXeCt4rTlLsl1xXv2SaJDAzr4wbadogEfRAXKdjI
DaMwGxBiTWiwJ7zHieI4Xm9WihaczrOG/cO1Wrziv4/9IpQsySyYUK7QnrWQj9bW
4H7/xPvU17uZ0BiOEyHaINZa0jyhAsevsrqNXyFr6d5HMvgzBpxmekcLgGIxPTzh
/zb8MuBdgn5OzAPlU/+iQJCGV8WyL6UPzeo65fCB8wBsnYZFXhaaLOp9qGJY1ouF
XJ108mNGSzz3X4ZWVyLxaG/tKFvvPpyhWYK+ORwBicg4CHjCTrBkcwEKFuiQts0V
rbZHeSdIQQmJ9MzbPW7Uys94u7UYqUy1bvrNy4TMl71hzKnnfvYq+kjsgfX+Sf6u
UvK0fYDqWKXugWFLhbDEUjejM58j3Owy6EOozuMnbZNPgTHGujQRmj8E2kDrzdPk
jP5zX2e5621EP0LdiKfLB3bxB5UHGZopAcKxJafeRwqToWIRUX8ZUGxJF3aw3zFC
RIXDOmc0r+r02BJsHdG8MHnVKxs9E8NS71kHahi9QdF2dZxhYW3xc3vByjWBVV90
RaqrUfF1raB2weZQ5Lf6fgmKNabfwPNUFU4+uRaKqFOFcMbInvUKBS4b44ECAwEA
AQKCAgBGOvslaW4CvMFxaUYFPtdTd0Uznu32MUEBD4hmCPA6sQUXG13V2/uphPjO
Qoyws+xvyjbsZzvtOvr0RKuKXxLvNgZGCbXJDkoYroMijaDsDt8pE7J7h9B9E9y+
9POpwL022fujTVN3j331IUVHKo1wksqUXrkEohcnHmdkPnM8i9rFqxhRyWMg27IY
hLOtSvXTA6gfoN0JynuV3oUY+850BBX28Yvx5YFUR9D8kEsBgIjXp21F3kDY/W6k
R2NlNPbU4l7plZEU7sDAXKP4irLVYhl2BXannTFZMOuI/7J16cBYKvkf966rDPqk
v96bukpXRIfjp2htb9r1tyFDUHXxHUga5+mGAzqQVx5IAEkeP6khgLspqSx5AsXW
gXkoOtGn91veepLV1Bs0buFfBqabkILYDiqAC7n5v/OPEGB3DfX4Oqkkh/vlr42K
ahMWLjcDVOSh+xP3bCE5aJSvz4LUyqJFCjIVGz3PpHKZzwkBJwibyAMvgQkvoJKJ
gkHyqwz9LTYG+x7yVPF5iPo0u6yazrpaR5n5DaouUnaCGalAG/z3W7R07+TEs6dY
v0Ca/YqlO1foCKMCDFQ6cGbIhe92E3gXNSxVeD1eYrbZQi11B/7GDgsyujD9aoEI
+JJGiNOz6EbJPwgBmDsHWB+mmVD6b9X6it4DEXn1b+uZqMwpUQKCAQEA9auOu0z4
gb5C6l+osmIhSKUEA5/o8ZXATqpKyyTeXk2evY/bdTNy9DZQmzaABxSuXXzGeViS
PfKC8Jgaai+mCQ6/7cbMFHG3PctLVzBoAUpFdZKY23LibFvLs2CjcHK7FvxDSwlE
KsMfxrmR8rmwVdzRnNpL1dmzDm28MWw6K9PScsXPsDrq7Sq5c5GgHfRTCW4RKv8z
yXhEX5GKDAxVv02tkx6yUQHw7fzKF79mfFEPYqn3mEQN1QfStabEdsFKiRYVjvxp
5E1gOjv4HayPNqo92KYn3x2VkyUNoDwkkJhc4EVmSEo20YEIu/IS81pO4FjyMMee
4xyQONGl7waGowKCAQEA80P0tr+Qz+Y9TNCAKLooGQwKVFURoakfvoHmJuxqJ8ox
3sTIAROtu9UzAvZdbD+1B8EjQxFn1o71w6XleuuBoGsfRjn2T70eGH2aylWY9/Vj
mhWj9zJqBfN3kT5lzYQIF7Kso7IfJWldAfW8wneEFMseRydzHp6L+ArfPVto5qL5
9P3kZs9IY3YurKU5/aMiJNZpDvGLJzpr2UzRilCtfyAMDuXPH81UKsrFlwwtGtY0
AsRFppQKOMdRgmmFCb8jNe3F7SY8ex5brRIjhyFXmBw+/QzzZWVv+ZOG/4L5o7Ow
355tosxf2YRT755F9xLm9Hzi18nYIOShsanVwz2jiwKCAQAW5XJcCoRusyjRZzD1
zyeC+b4yCElRmr9dlYl6/WisKVfOGwY9GhpwoE9K5/1uq4LEu8hTrumSVHPXsJVl
qCM1XOaOZqTGkwKdA8F10tEeraljl9IfQcnQh42oni0dYdQGBGTRLX/o7F6dytXL
ZXsFxZrTn5TJzYxen+OWR5v0Ub2fbMg6iIM0r3KxTrU5lXfXvSZkd3yAHnFg5tOS
4+Np/PdcatP7sM6fn5vGMtR+aZ+hdm3ZBx6y6BO/UlelKcakmCZSOTw1RvDc/JHX
UinW0m8JLhMxPDSgjieC85gE0e52CIHL4v7Q79G8kocpnxUS27dWzIQGbrcSVJe+
e0E5AoIBADZ4ygw92xxijulrarcz8BSjuJBnuBn99+i9x56Bo8ejJAWhBLQRBv8f
X1vTdNnvbgb9fXrgI+NMgcW8mSUsJQuZ0Rf1lK0ISPvs7ENQZX9oiFQRcnTA6jLI
8MYqNbuOTA2aacQB96116Wit8QWOo5nQXchLEiESGX+CV7iyhkvWxKfSTlmjIq96
4DqyiMi9xcB/7mh1N9ah41J2PBl/tUnZEDopxXZ2kNlALHyFMnhm7KCN+JazYZKT
NzI/lJW5IhZKVt6iiDp9csPPYvs4QRgDgytAwiO7UhaNrVX7qxC4BOwd2qjwoKnh
UrY+N6Z6qhKnAFiXjvjWmUpiIEamv78CggEBALh+3hKv9PVj33KX3tbFri5oOKYP
6A2oxv7elGmwXbeTC7OdtFbFeK4SMn45oWIDOZiLZBhV5ySkFX8vzN+fWbleJ2JG
KL9gcPW3xu1QZ61DvY7Ym0GWN+N5FdQanSaDvWD46w7Nw/ZpYIOM0h3gUOAbaxkJ
kdVgO9BgdWU60DalNKlD1NBwiZAIihztJVzahUai/FQJpGVPPye3bRrz8uWMluCk
Tk4iJgK0A4Nnhza0O18XDjulKkpetZvgpYE+hyAw1csffYR6nsTVB9hVo+9GiZ8r
XwGRyA6sQ5MNmeA8E8AelvKR3Nodzyiz2oUEhv7RHewyQaPa3xcolkbBSaQ=
-----END RSA PRIVATE KEY-----

EOT
public_ip = "54.196.64.157"[0m
```
</details>
#### Terraform Destroy `success`
<details><summary>Show Destroy</summary>
```terraform
[0m[1maws_route_table_association.b: Destroying... [id=rtbassoc-05e1afac58f1e0d36][0m[0m
[0m[1maws_route_table_association.a: Destroying... [id=rtbassoc-072770ef0509d9c7f][0m[0m
[0m[1maws_instance.wordpress: Destroying... [id=i-081b221bb04e856f7][0m[0m
[0m[1maws_route_table_association.a: Destruction complete after 0s[0m[0m
[0m[1maws_route_table_association.b: Destruction complete after 0s[0m[0m
[0m[1maws_route_table.public: Destroying... [id=rtb-0e061e6ae85a84acc][0m[0m
[0m[1maws_subnet.public-b: Destroying... [id=subnet-0feb73a0520a1d85e][0m[0m
[0m[1maws_route_table.public: Destruction complete after 0s[0m[0m
[0m[1maws_internet_gateway.igw-tf: Destroying... [id=igw-06e45346357a8d3db][0m[0m
[0m[1maws_subnet.public-b: Destruction complete after 1s[0m[0m
[0m[1maws_instance.wordpress: Still destroying... [id=i-081b221bb04e856f7, 10s elapsed][0m[0m
[0m[1maws_internet_gateway.igw-tf: Still destroying... [id=igw-06e45346357a8d3db, 10s elapsed][0m[0m
[0m[1maws_instance.wordpress: Still destroying... [id=i-081b221bb04e856f7, 20s elapsed][0m[0m
[0m[1maws_internet_gateway.igw-tf: Still destroying... [id=igw-06e45346357a8d3db, 20s elapsed][0m[0m
[0m[1maws_instance.wordpress: Still destroying... [id=i-081b221bb04e856f7, 30s elapsed][0m[0m
[0m[1maws_internet_gateway.igw-tf: Still destroying... [id=igw-06e45346357a8d3db, 30s elapsed][0m[0m
[0m[1maws_instance.wordpress: Still destroying... [id=i-081b221bb04e856f7, 40s elapsed][0m[0m
[0m[1maws_internet_gateway.igw-tf: Still destroying... [id=igw-06e45346357a8d3db, 40s elapsed][0m[0m
[0m[1maws_instance.wordpress: Still destroying... [id=i-081b221bb04e856f7, 50s elapsed][0m[0m
[0m[1maws_internet_gateway.igw-tf: Still destroying... [id=igw-06e45346357a8d3db, 50s elapsed][0m[0m
[0m[1maws_instance.wordpress: Still destroying... [id=i-081b221bb04e856f7, 1m0s elapsed][0m[0m
[0m[1maws_internet_gateway.igw-tf: Still destroying... [id=igw-06e45346357a8d3db, 1m0s elapsed][0m[0m
[0m[1maws_instance.wordpress: Still destroying... [id=i-081b221bb04e856f7, 1m10s elapsed][0m[0m
[0m[1maws_internet_gateway.igw-tf: Still destroying... [id=igw-06e45346357a8d3db, 1m10s elapsed][0m[0m
[0m[1maws_instance.wordpress: Still destroying... [id=i-081b221bb04e856f7, 1m20s elapsed][0m[0m
[0m[1maws_internet_gateway.igw-tf: Still destroying... [id=igw-06e45346357a8d3db, 1m20s elapsed][0m[0m
[0m[1maws_instance.wordpress: Still destroying... [id=i-081b221bb04e856f7, 1m30s elapsed][0m[0m
[0m[1maws_internet_gateway.igw-tf: Still destroying... [id=igw-06e45346357a8d3db, 1m30s elapsed][0m[0m
[0m[1maws_instance.wordpress: Still destroying... [id=i-081b221bb04e856f7, 1m40s elapsed][0m[0m
[0m[1maws_internet_gateway.igw-tf: Still destroying... [id=igw-06e45346357a8d3db, 1m40s elapsed][0m[0m
[0m[1maws_instance.wordpress: Still destroying... [id=i-081b221bb04e856f7, 1m50s elapsed][0m[0m
[0m[1maws_internet_gateway.igw-tf: Still destroying... [id=igw-06e45346357a8d3db, 1m50s elapsed][0m[0m
[0m[1maws_instance.wordpress: Still destroying... [id=i-081b221bb04e856f7, 2m0s elapsed][0m[0m
[0m[1maws_internet_gateway.igw-tf: Still destroying... [id=igw-06e45346357a8d3db, 2m0s elapsed][0m[0m
[0m[1maws_instance.wordpress: Still destroying... [id=i-081b221bb04e856f7, 2m10s elapsed][0m[0m
[0m[1maws_internet_gateway.igw-tf: Still destroying... [id=igw-06e45346357a8d3db, 2m10s elapsed][0m[0m
[0m[1maws_instance.wordpress: Still destroying... [id=i-081b221bb04e856f7, 2m20s elapsed][0m[0m
[0m[1maws_internet_gateway.igw-tf: Still destroying... [id=igw-06e45346357a8d3db, 2m20s elapsed][0m[0m
[0m[1maws_internet_gateway.igw-tf: Destruction complete after 2m28s[0m[0m
[0m[1maws_instance.wordpress: Still destroying... [id=i-081b221bb04e856f7, 2m30s elapsed][0m[0m
[0m[1maws_instance.wordpress: Destruction complete after 2m31s[0m[0m
[0m[1maws_key_pair.deployer: Destroying... [id=ec2-key-tf][0m[0m
[0m[1maws_db_instance.dbWordPress: Destroying... [id=terraform-20210226110443265600000001][0m[0m
[0m[1maws_subnet.public-a: Destroying... [id=subnet-02271d48835ee7daa][0m[0m
[0m[1maws_key_pair.deployer: Destruction complete after 0s[0m[0m
[0m[1mtls_private_key.example: Destroying... [id=6885d8c4df232567c714f31fdeb870a76ebbeac8][0m[0m
[0m[1mtls_private_key.example: Destruction complete after 0s[0m[0m
[0m[1maws_subnet.public-a: Destruction complete after 0s[0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 10s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 20s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 30s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 40s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 50s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 1m0s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 1m10s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 1m20s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 1m30s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 1m40s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 1m50s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 2m0s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 2m10s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 2m20s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 2m30s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 2m40s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 2m50s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 3m0s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 3m10s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 3m20s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 3m30s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Still destroying... [id=terraform-20210226110443265600000001, 3m40s elapsed][0m[0m
[0m[1maws_db_instance.dbWordPress: Destruction complete after 3m43s[0m[0m
[0m[1mrandom_password.dbpassword: Destroying... [id=none][0m[0m
[0m[1maws_security_group.allow_rds: Destroying... [id=sg-0e5d450a049d2c5c9][0m[0m
[0m[1mrandom_password.dbpassword: Destruction complete after 0s[0m[0m
[0m[1maws_db_subnet_group.rds: Destroying... [id=wordpress][0m[0m
[0m[1maws_db_subnet_group.rds: Destruction complete after 0s[0m[0m
[0m[1maws_subnet.private-b: Destroying... [id=subnet-0459a717378437eb9][0m[0m
[0m[1maws_subnet.private-a: Destroying... [id=subnet-0a72e116df855dfcf][0m[0m
[0m[1maws_security_group.allow_rds: Destruction complete after 0s[0m[0m
[0m[1maws_security_group.allow_http: Destroying... [id=sg-0694122bfe1004989][0m[0m
[0m[1maws_subnet.private-b: Destruction complete after 1s[0m[0m
[0m[1maws_subnet.private-a: Destruction complete after 1s[0m[0m
[0m[1maws_security_group.allow_http: Destruction complete after 1s[0m[0m
[0m[1maws_vpc.epsi-tf: Destroying... [id=vpc-0628e158123f1747a][0m[0m
[0m[1maws_vpc.epsi-tf: Destruction complete after 0s[0m[0m
[0m[1m[32m
Destroy complete! Resources: 17 destroyed.[0m
```
</details>

*Pusher: @Salombo, Action: `pull_request`*